code-review/NRB_3471_3546/База_Стало/InformationRegisters/СостоянияМетрик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияМетрик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Метрика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МетрикиPrometheus</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/МетодыПолученияМетрик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МетодыПолученияМетрик</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Pull</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PullИзКэша</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ТипыМетрикPrometheus.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыМетрикPrometheus</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Counter</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Gauge</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ТипыВычисленияМетрик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыВычисленияМетрик</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алгоритм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлючеваяОперацияСредниеЗаПериод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/CommonModules/МетрикиСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область РегламентныеЗадания

// Запускает расчет метрик, которые должны рассчитываться методом PullИзКэша
//
// Параметры:
//  Метрика - СправочникСсылка.МетрикиPrometheus
//
Процедура РассчитатьМетрикиРегламентнымЗаданием(Метрика = Неопределено) Экспорт
	
	ПолучитьМетрики(Перечисления.МетодыПолученияМетрик.PullИзКэша, Метрика);
	
КонецПроцедуры

// Операции удаления неактуальных метрик
Процедура РегламентныеОперации() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ПараметрПодсистемы("1562.Prometheus_ПервоначальноеЗаполнениеВыполнено") Тогда
		ВыполнитьПервоначальноеЗаполнение();
	КонецЕсли;
	
	ЗаписьРегистраСостояний = РегистрыСведений.СостоянияМетрик.СоздатьМенеджерЗаписи();
	ЗаписьРегистраСостояний.Метрика = Справочники.МетрикиPrometheus.ПустаяСсылка();
	ЗаписьРегистраСостояний.Прочитать();
	Если ЗаписьРегистраСостояний.Выбран() Тогда
		ЗаписьРегистраСостояний.Удалить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СостоянияМетрик.Метрика КАК Метрика
	|ИЗ
	|	РегистрСведений.СостоянияМетрик КАК СостоянияМетрик
	|ГДЕ
	|	СостоянияМетрик.Метрика.Активность = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьРегистраСостояний.Метрика = Выборка.Метрика;
		ЗаписьРегистраСостояний.Удалить();
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПерсональнымиЗаданиями

// Структура параметров для регзадания
// Параметры:
//	Идентификатор - УникальныйИдентификатор - идентифкатор задания
// Возвращаемое значение:
//  Структура - см. ОписаниеПараметровРегламентногоЗадания()
Функция СтруктураПараметровРегламентногоЗадания(Идентификатор = Неопределено) Экспорт
	
	ОписаниеРегламентногоЗадания = ОписаниеПараметровРегламентногоЗадания();
	РегламентноеЗадание = ПолучитьРегламентноеЗаданиеПоИдентификатору(Идентификатор);
	
	ЗаполнитьЗначенияСвойств(ОписаниеРегламентногоЗадания, РегламентноеЗадание);
	
	Возврат ОписаниеРегламентногоЗадания;
	
КонецФункции

// В привилегированном режиме последовательно удаляет, обновляет, создает задание
//
// Параметры:
//  ПараметрыРегламентногоЗадания - Структура
//  ЗаданиеМетаданные - Метаданные.РегламентныеЗадания.РасчетМетрикPrometheus
//
Процедура ОбновитьРегламентноеЗадание(ПараметрыРегламентногоЗадания, ЗаданиеМетаданные) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	УдалениеПерсональногоЗадания(ПараметрыРегламентногоЗадания);
	
	Если Не ПараметрыРегламентногоЗадания.Предопределенное И Не ПараметрыРегламентногоЗадания.Использование Тогда
		ПараметрыРегламентногоЗадания.УникальныйИдентификатор = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
		Возврат;
	КонецЕсли;
	
	Если ПараметрыРегламентногоЗадания.Предопределенное Тогда
		РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(ЗаданиеМетаданные);
	Иначе
		Попытка
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ПараметрыРегламентногоЗадания.УникальныйИдентификатор);
			Если РегламентноеЗадание.Предопределенное Тогда
				РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(ЗаданиеМетаданные);
			КонецЕсли;
		Исключение
			РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(ЗаданиеМетаданные);
		КонецПопытки;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РегламентноеЗадание, ПараметрыРегламентногоЗадания, , "УникальныйИдентификатор");
	РегламентноеЗадание.Записать();
	
	Если ПараметрыРегламентногоЗадания.Предопределенное Тогда
		ПараметрыРегламентногоЗадания.УникальныйИдентификатор = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	Иначе
		ПараметрыРегламентногоЗадания.УникальныйИдентификатор = РегламентноеЗадание.УникальныйИдентификатор;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// В привилегированном режиме удаляет регламентное задание с определенными параметрами
//
// Параметры:
//  ПараметрыРегламентногоЗадания - Структура
//
Процедура УдалениеПерсональногоЗадания(ПараметрыРегламентногоЗадания) Экспорт
	
	Условие1 = ПараметрыРегламентногоЗадания.Предопределенное
		И ЗначениеЗаполнено(ПараметрыРегламентногоЗадания.УникальныйИдентификатор);
	Условие2 = Не ПараметрыРегламентногоЗадания.Предопределенное
		И ЗначениеЗаполнено(ПараметрыРегламентногоЗадания.УникальныйИдентификатор)
		И Не ПараметрыРегламентногоЗадания.Использование;
		
	Если Условие1 Или Условие2 Тогда
		УстановитьПривилегированныйРежим(Истина);
		УдалитьРегламентноеЗаданиеПоИдентификатору(ПараметрыРегламентногоЗадания.УникальныйИдентификатор);
		ПараметрыРегламентногоЗадания.УникальныйИдентификатор = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПервоначальноеЗаполнение
// Некоторые параметры подсистемы должны быть заполнены принудительно или повторно
Процедура ВыполнитьПервоначальноеЗаполнение() Экспорт
	
	МассивМетрикДляЗаписи = Новый Массив;
	
	ОписаниеМетрики = Справочники.МетрикиPrometheus.pde_scrape_duration.ПолучитьОбъект();
	ОписаниеМетрики.Наименование = "Длительность расчета метрик (миллисекунд)";
	ОписаниеМетрики.ТипМетрики = Перечисления.ТипыМетрикPrometheus.Gauge;
	ОписаниеМетрики.МетодПолученияМетрики = Перечисления.МетодыПолученияМетрик.Pull;
	ОписаниеМетрики.Активность = Истина;
	ОписаниеМетрики.ТипВычисленияМетрики = Перечисления.ТипыВычисленияМетрик.Алгоритм;
	ОписаниеМетрики.ИдентификаторРегламента = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	ОписаниеМетрики.Алгоритм =
	"ТаблицаЗначений = Новый ТаблицаЗначений;
	|ТаблицаЗначений.Колонки.Добавить(""label"", Новый ОписаниеТипов(""Строка""));
	|ТаблицаЗначений.Колонки.Добавить(""value"", Новый ОписаниеТипов(""Число""));
	|
	|Запрос = Новый Запрос;
	|Запрос.Текст =
	|""ВЫБРАТЬ
	|СостоянияМетрик.Метрика.Код КАК label,
	|СостоянияМетрик.Длительность КАК value
	||ИЗ
	||	РегистрСведений.СостоянияМетрик КАК СостоянияМетрик"";
	|Результат = Запрос.Выполнить();
	|
	|Если Не Результат.Пустой() Тогда
	|	ТаблицаЗначений = Результат.Выгрузить();
	|КонецЕсли;
	|";
	МассивМетрикДляЗаписи.Добавить(ОписаниеМетрики);
	
	ОписаниеМетрики = Справочники.МетрикиPrometheus.pde_last_refresh.ПолучитьОбъект();
	ОписаниеМетрики.Наименование = "Задержка обновления метрик (секунд)";
	ОписаниеМетрики.ТипМетрики = Перечисления.ТипыМетрикPrometheus.Counter;
	ОписаниеМетрики.МетодПолученияМетрики = Перечисления.МетодыПолученияМетрик.Pull;
	ОписаниеМетрики.Активность = Истина;
	ОписаниеМетрики.ТипВычисленияМетрики = Перечисления.ТипыВычисленияМетрик.Алгоритм;
	ОписаниеМетрики.ИдентификаторРегламента = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	ОписаниеМетрики.Алгоритм =
	"ТаблицаЗначений = Новый ТаблицаЗначений;
	|ТаблицаЗначений.Колонки.Добавить(""label"", Новый ОписаниеТипов(""Строка""));
	|ТаблицаЗначений.Колонки.Добавить(""value"", Новый ОписаниеТипов(""Число""));
	|
	|Запрос = Новый Запрос;
	|Запрос.Текст =
	|""ВЫБРАТЬ
	|СостоянияМетрик.Метрика.Код КАК label,
	||	РАЗНОСТЬДАТ(СостоянияМетрик.ДатаРасчета, &ТекущаяДата, СЕКУНДА) КАК value
	||ИЗ
	||	РегистрСведений.СостоянияМетрик КАК СостоянияМетрик"";
	|Запрос.УстановитьПараметр(""ТекущаяДата"", ТекущаяДата());
	|Результат = Запрос.Выполнить();
	|
	|Если Не Результат.Пустой() Тогда
	|	ТаблицаЗначений = Результат.Выгрузить();
	|КонецЕсли;
	|";
	МассивМетрикДляЗаписи.Добавить(ОписаниеМетрики);
	
	НачатьТранзакцию();
	Попытка
		УстановитьПараметрыПервоначальногоЗаполнения();
		Для Каждого Метрика Из МассивМетрикДляЗаписи Цикл
			Метрика.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение "Не удалось выполнить первоначальное заполнение: " + ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область Проверки
// Универсальная проверка корректного заполнения метрик
//
// Параметры:
//  Объект - СправочникОбъект.МетрикиPrometheus
//  Отказ - Булево
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Объект, Отказ) Экспорт
	
	МаскаИмениМетрики = "[a-zA-Z_:][a-zA-Z0-9_:]*";
	Результат = МетрикиСервер.ПроверитьСтрокуНаСоответствиеМаске(Объект.Код, МаскаИмениМетрики);
	Если Результат.ЕстьОшибка Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Имя метрики не соответствует маске: " + МаскаИмениМетрики, Отказ);
		Возврат;
	КонецЕсли;
	
	Если Объект.ТипВычисленияМетрики = Перечисления.ТипыВычисленияМетрик.Алгоритм Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Алгоритм) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Алгоритм должен быть заполнен", Отказ);
			Возврат;
		КонецЕсли;
		
	ИначеЕсли Объект.ТипВычисленияМетрики = Перечисления.ТипыВычисленияМетрик.КлючеваяОперацияСредниеЗаПериод Тогда
		
		Если Не ЗначениеЗаполнено(Объект.КлючеваяОперация) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("КлючеваяОперация должна быть заполнена", Отказ);
			Возврат;
		КонецЕсли;
		Если Объект.ПериодыВычисления.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Периоды вычисления должны быть указаны", Отказ);
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


// Проверка подстроки по маске
//
// Параметры:
//   Строка - Строка - проверяемая строка
//   Маска - Строка - Допустимы следующие символы:
//     - . - любой символ
//     - + - один или более раз, пример ".+" - один или более любой символ.
//     - * - ноль или более раз, пример ".*" - любое количество любых символов (даже ни одного).
//     - [m-n] - символ от m до n. Например: [a-zA-Z_:]* - строка любой длины, состоящая из больших и маленьких латинских символов,
//		  знаков "_" и ":" , Еще пример: "[0-9]+" - одна или более цифр(а).
//     - \d - цифра, пример 
//     - \d+ - одна или более цифр(а).
//     - \D - не цифра.
//     - \s - пробельный символ - ТАБ, пробел, перенос строки, возврат каретки и т.п.
//     - \S - непробельный символ.
//     - \w - буква, цифра, подчеркивание.
//     - \W - не буква, не цифра и не подчеркивание соответственно.
//     - ^ - начало текста, например "^\d+" - строка начинается с цифры.
//     - $ - конец текста, например "\D+$" - строка заканчивается НЕ цифрой.
//     - {m,n} - шаблон для от m до n символов, например "\d{2,4}" - от двух до четырех цифр. Можно указать одну и всего цифру 
//		  	для строгого соответвия.
//     - \ - экранирует спецсимволы. Например, "\." - символ точки.
// 
// Возвращаемое значение:
//   Структура - описание ответа
//
Функция ПроверитьСтрокуНаСоответствиеМаске(Строка, Маска) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ЕстьОшибка", Истина);
	СтруктураВозврата.Вставить("ОписаниеОшибки", "Ошибка в коде");
	СтруктураВозврата.Вставить("Результат", Неопределено);
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(
		"<Model xmlns=""http://v8.1c.ru/8.1/xdto"" xmlns:xs=""http://www.w3.org/2001/XMLSchema""
		|xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xsi:type=""Model"">
		|<package targetNamespace=""sample-my-package"">
		|<valueType name=""testtypes"" base=""xs:string"">
		|<pattern>" + Маска + "</pattern>
		|</valueType>
		|<objectType name=""TestObj"">
		|<property xmlns:d4p1=""sample-my-package"" name=""TestItem"" type=""d4p1:testtypes""/>
		|</objectType>
		|</package>
		|</Model>");
	
	Модель = ФабрикаXDTO.ПрочитатьXML(Чтение);
	
	Попытка
		МояФабрикаXDTO = Новый ФабрикаXDTO(Модель);
	Исключение
		СтруктураВозврата.ЕстьОшибка = Истина;
		СтруктураВозврата.ОписаниеОшибки = "Ошибка маски";
		Возврат СтруктураВозврата;
	КонецПопытки;
	
	Пакет = МояФабрикаXDTO.Пакеты.Получить("sample-my-package");
	Тест = МояФабрикаXDTO.Создать(Пакет.Получить("TestObj"));
	
	Попытка
		Тест.TestItem = Строка;
	Исключение
		СтруктураВозврата.ЕстьОшибка = Истина;
		СтруктураВозврата.ОписаниеОшибки = "Строка не соответствует маске";
		СтруктураВозврата.Результат = Ложь;
		Возврат СтруктураВозврата;
	КонецПопытки;
	
	СтруктураВозврата.ЕстьОшибка = Ложь;
	СтруктураВозврата.ОписаниеОшибки = "";
	СтруктураВозврата.Результат = Истина;
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область ФормированиеМетрикЭкспорт
// Формирование метрик из кэша и онлайн для http-сервиса
// Возвращаемое значение:
//  Строка
Функция МетрикиПоЗапросу() Экспорт
	
	ОнлайнМетрики = ПолучитьМетрики(Перечисления.МетодыПолученияМетрик.Pull, Неопределено);
	СохраненныеМетрики = СохраненныеМетрики();
	Возврат ОнлайнМетрики + СохраненныеМетрики;
	
КонецФункции

// Формирование метрик из кэша и онлайн при помощи фонового задания
//
// Параметры:
//  ВходныеПараметры - Структура - см.СформироватьМетрикиАсинхронно()
//
Процедура СформироватьМетрикуФоновымЗаданием(ВходныеПараметры) Экспорт
	
	ДатаНачалаРасчета = ТекущаяДатаСеанса();
	ДатаНачалаРасчетаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ПараметрыМетрики = НовыеПараметрыМетрики();
	ПараметрыМетрики.Алгоритм = ВходныеПараметры.Алгоритм;
	ПараметрыМетрики.КлючеваяОперация = ВходныеПараметры.КлючеваяОперация;
	ПараметрыМетрики.ТипВычисленияМетрики = ВходныеПараметры.ТипВычисленияМетрики;
	ПараметрыМетрики.ПериодыВычисления = ВходныеПараметры.ПериодыВычисления;
	
	Результат = ДанныеМетрики(ПараметрыМетрики);
	Если Результат.Ошибка Тогда
		ПоместитьВоВременноеХранилище(Результат, ВходныеПараметры.АдресВХранилище);
		Возврат;
	КонецЕсли;
	
	Результат = ПривестиТаблицуРасчетаМетрикиКСтрокеPrometheus(
		ВходныеПараметры.ИмяМетрики, ВходныеПараметры.ТипМетрики, ВходныеПараметры.Комментарий, Результат.МетрикаТаблицей);
	Если Результат.Ошибка Тогда
		ПоместитьВоВременноеХранилище(Результат, ВходныеПараметры.АдресВХранилище);
		Возврат;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, ВходныеПараметры.АдресВХранилище);
	ЗаписатьИнформациюОРасчетеМетрикиФоновымЗаданием(ВходныеПараметры.Метрика,
		ДатаНачалаРасчетаВМиллисекундах, 
		ДатаНачалаРасчета, 
		Результат.МетрикаСтрокой);
	
КонецПроцедуры

// Параметры метрики для последующего расчета
// Возвращаемое значение:
//  Структура
Функция НовыеПараметрыМетрики() Экспорт
	ПараметрыМетрики = Новый Структура;
	ПараметрыМетрики.Вставить("Алгоритм");
	ПараметрыМетрики.Вставить("КлючеваяОперация");
	ПараметрыМетрики.Вставить("ТипВычисленияМетрики");
	ПараметрыМетрики.Вставить("ПериодыВычисления");
	Возврат ПараметрыМетрики;
КонецФункции

// Формирование метрик из кэша и онлайн при помощи фонового задания
//
// Параметры:
//  Параметры - Структура - см.СформироватьМетрикиАсинхронно()
// Возвращаемое значение:
//  Структура - см.НоваяСтруктураДанныхМетрики
//
Функция ДанныеМетрики(Параметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Параметры.ТипВычисленияМетрики) Тогда
		Структура = НоваяСтруктураДанныхМетрики();
		Структура.Ошибка = Истина;
		Возврат Структура;
	ИначеЕсли Параметры.ТипВычисленияМетрики = Перечисления.ТипыВычисленияМетрик.Алгоритм Тогда
		Возврат СформироватьМетрику(Параметры.Алгоритм);
	ИначеЕсли Параметры.ТипВычисленияМетрики = Перечисления.ТипыВычисленияМетрик.КлючеваяОперацияСредниеЗаПериод Тогда
		Возврат СформироватьМетрикуПоКлючевойОперации(
			Параметры.КлючеваяОперация, Параметры.ПериодыВычисления);
	Иначе
		ВызватьИсключение "Неизвестный тип вычисления метрики <" + Параметры.ТипВычисленияМетрики + ">";
	КонецЕсли;
	
КонецФункции

// Структура для передачи данных о получении метрики
// Возвращаемое значение:
//  Структура
Функция НоваяСтруктураДанныхМетрики() Экспорт
	Структура = Новый Структура;
	Структура.Вставить("МетрикаТаблицей", Новый ТаблицаЗначений);
	Структура.Вставить("ОписаниеОшибки", "");
	Структура.Вставить("Ошибка", Ложь);
	Возврат Структура;
КонецФункции

// Структура для передачи данных о получении метрики
// Параметры:
//  ИмяМетрики - Строка - наименование метрики как оно будет в Prometheus 
//	ТипМетрики - ПеречислениеСсылка.ТипыМетрикPrometheus
//	Комментарий - Строка - сопроводительный комментарий метрики
//	МетрикаТаблицейЗначений - ТаблицаЗначений - Таблица с показателями и значениями метрики. Например, НоваяПустаяТаблицаМетрики()
//
// Возвращаемое значение:
//  Структура
Функция ПривестиТаблицуРасчетаМетрикиКСтрокеPrometheus(ИмяМетрики, ТипМетрики, Комментарий, МетрикаТаблицейЗначений) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("МетрикаСтрокой", "");
	СтруктураВозврата.Вставить("Ошибка", Ложь);
	СтруктураВозврата.Вставить("ОписаниеОшибки", "");
	
	Если Не МетрикаТаблицейЗначений.Количество() Тогда
		СтруктураВозврата.Ошибка = Истина;
		СтруктураВозврата.ОписаниеОшибки = "Пустая метрика";
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Попытка
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		
		Если ЗначениеЗаполнено(Комментарий) Тогда
			ЗаписьJSON.ЗаписатьБезОбработки("# HELP ");
			ЗаписьJSON.ЗаписатьБезОбработки(ИмяМетрики);
			ЗаписьJSON.ЗаписатьБезОбработки(" ");
			ЗаписьJSON.ЗаписатьБезОбработки(Комментарий);
			ЗаписьJSON.ЗаписатьБезОбработки(Символы.ПС);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТипМетрики) Тогда
			Синоним = Метаданные.Перечисления.ТипыМетрикPrometheus.ЗначенияПеречисления[
				Перечисления.ТипыМетрикPrometheus.Индекс(ТипМетрики)].Синоним;
			ЗаписьJSON.ЗаписатьБезОбработки("# TYPE ");
			ЗаписьJSON.ЗаписатьБезОбработки(ИмяМетрики);
			ЗаписьJSON.ЗаписатьБезОбработки(" ");
			ЗаписьJSON.ЗаписатьБезОбработки(Синоним);
			ЗаписьJSON.ЗаписатьБезОбработки(Символы.ПС);
		КонецЕсли;
		
		ИмяКолонкиЗначение = "value";
		Если МетрикаТаблицейЗначений.Колонки.Найти(ИмяКолонкиЗначение) = Неопределено Тогда
			ВызватьИсключение "Метрика " + ИмяМетрики + " не содержит колонки value";
		КонецЕсли;
		
		Для Каждого Строка Из МетрикаТаблицейЗначений Цикл
			
			ЗаписьJSON.ЗаписатьБезОбработки(ИмяМетрики);
			ЗаписьJSON.ЗаписатьБезОбработки("{");
			
			ВыводитьРазделитель = Ложь;
			
			Для Каждого Колонка Из МетрикаТаблицейЗначений.Колонки Цикл
				
				Если Колонка.Имя = ИмяКолонкиЗначение Тогда
					Продолжить;
				КонецЕсли;
				
				Если ВыводитьРазделитель Тогда
					ЗаписьJSON.ЗаписатьБезОбработки(", ");
				КонецЕсли;
				
				ЗаписьJSON.ЗаписатьБезОбработки(Колонка.Имя);
				ЗаписьJSON.ЗаписатьБезОбработки("=""");
				ЗаписьJSON.ЗаписатьБезОбработки(Строка[Колонка.Имя]);
				ЗаписьJSON.ЗаписатьБезОбработки("""");
				
				ВыводитьРазделитель = Истина;
				
			КонецЦикла;
			
			ЗаписьJSON.ЗаписатьБезОбработки("} ");
			ЗаписьJSON.ЗаписатьБезОбработки(Строка(Формат(Строка[ИмяКолонкиЗначение], "ЧРД=.; ЧРГ=; ЧДЦ=4; ЧН=; ЧГ=;")));
			ЗаписьJSON.ЗаписатьБезОбработки(Символы.ПС);
		
		КонецЦикла;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Prometheus data exporter",
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		СтруктураВозврата.Ошибка = Истина;
		СтруктураВозврата.ОписаниеОшибки = ОписаниеОшибки;
		Возврат СтруктураВозврата;
	КонецПопытки;
	
	СтруктураВозврата.МетрикаСтрокой = ЗаписьJSON.Закрыть();
	
	Возврат СтруктураВозврата;
	
КонецФункции

// запись данных в РС СостоянияМетрик 
// Параметры:
//  Метрика - СправочникСсылка.МетрикиPrometheus
//	ДатаНачалаРасчетаВМиллисекундах - Число
//	ДатаОкончанияРасчетаВМиллисекундах - Число
//	ДатаНачалаРасчета - ДатаВремя
//	МетрикаСтрокой - Строка - все значения и показатели метрики
Процедура ЗаписатьИнформациюОРасчетеМетрики(
	Метрика, ДатаНачалаРасчетаВМиллисекундах, ДатаОкончанияРасчетаВМиллисекундах, ДатаНачалаРасчета, МетрикаСтрокой) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СостоянияМетрик.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Метрика = Метрика;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Метрика = Метрика;
	МенеджерЗаписи.Данные = МетрикаСтрокой;
	МенеджерЗаписи.ДатаРасчета = ДатаНачалаРасчета;
	МенеджерЗаписи.Длительность = ДатаОкончанияРасчетаВМиллисекундах - ДатаНачалаРасчетаВМиллисекундах;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Пустая таблица значений для формирования стандартного ответа для Prometheus
//  например, для строчки random{label="Показатель_1"} 2.0000
// Возвращаемое значение:
//  ТаблицаЗначений
Функция НоваяПустаяТаблицаМетрики() Экспорт
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("label", Новый ОписаниеТипов("Строка"));
	ТаблицаЗначений.Колонки.Добавить("value", Новый ОписаниеТипов("Число"));
	Возврат ТаблицаЗначений;
КонецФункции

// Добавление строки в таблицу значений стандартного ответа для Prometheus
// Параметры:
//	ТаблицаМетрик - ТаблицаЗначений - см.НоваяПустаяТаблицаМетрики()
//	Тэг - Строка - Показатель, Лейбл, Тэг
//	Значение - Число - значение показателя
Процедура ДобавитьКМетрикам(ТаблицаМетрик, Тэг, Значение) Экспорт
	НоваяСтрока = ТаблицаМетрик.Добавить();
	НоваяСтрока.label = Тэг;
	НоваяСтрока.value = Значение;
КонецПроцедуры

#КонецОбласти

#Область КлючевыеОперации

// Представление расписания для произвольного регламентного задания
//
// Параметры:
//  КлючеваяОперация - СправочникСсылка.КлючевыеОперации - ключевая операция
//  ПериодыВычисления - Массив - СправочникСсылка.ПериодыДляВычисленияМетрик
// 
// Возвращаемое значение:
//   Структура - см. МетрикиСервер.НоваяСтруктураДанныхМетрики()
//
Функция СформироватьМетрикуПоКлючевойОперации(КлючеваяОперация, ПериодыВычисления) Экспорт
	
	СтруктураВозврата = МетрикиСервер.НоваяСтруктураДанныхМетрики();
	
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		ТаблицаЗначений = СредниеПараметрыКлючевойОперации(КлючеваяОперация, ПериодыВычисления);
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Prometheus data exporter",
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		СтруктураВозврата.Ошибка = Истина;
		СтруктураВозврата.ОписаниеОшибки = ОписаниеОшибки;
		Возврат СтруктураВозврата;
	КонецПопытки;
	
	СтруктураВозврата.МетрикаТаблицей = ТаблицаЗначений;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти


#КонецОбласти

#Область ФормированиеМетрик 

Функция СохраненныеМетрики()
	
	МетрикиСтрокой = "";
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостоянияМетрик.Данные КАК Данные
	|ИЗ
	|	Справочник.МетрикиPrometheus КАК МетрикиPrometheus
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияМетрик КАК СостоянияМетрик
	|		ПО СостоянияМетрик.Метрика = МетрикиPrometheus.Ссылка
	|ГДЕ
	|	МетрикиPrometheus.Активность = ИСТИНА
	|	И МетрикиPrometheus.МетодПолученияМетрики = &МетодПолученияМетрики";
	
	Запрос.УстановитьПараметр("МетодПолученияМетрики", Перечисления.МетодыПолученияМетрик.PullИзКэша);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МетрикиСтрокой = МетрикиСтрокой + ВыборкаДетальныеЗаписи.Данные;
	КонецЦикла;
	
	Возврат МетрикиСтрокой;
	
КонецФункции

Функция ПолучитьМетрики(МетодПолученияМетрики, Метрика)
	
	Метрики = "";
	Асинхронно = ПараметрПодсистемы("1562.Prometheus_МногопоточныйРасчетМетрик");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МетрикиPrometheus.Код КАК ИмяМетрики,
	|	МетрикиPrometheus.Алгоритм КАК Алгоритм,
	|	МетрикиPrometheus.ТипМетрики КАК ТипМетрики,
	|	МетрикиPrometheus.Комментарий КАК Комментарий,
	|	МетрикиPrometheus.Ссылка КАК Метрика,
	|	МетрикиPrometheus.КлючеваяОперация КАК КлючеваяОперация,
	|	МетрикиPrometheus.ТипВычисленияМетрики КАК ТипВычисленияМетрики,
	|	МетрикиPrometheus.ПериодыВычисления.(
	|		ПериодВычисления КАК ПериодВычисления
	|	) КАК ПериодыВычисления
	|ИЗ
	|	Справочник.МетрикиPrometheus КАК МетрикиPrometheus
	|ГДЕ
	|	ИСТИНА = ИСТИНА";
	
	Если Метрика = Неопределено Тогда
		УсловиеЗапроса = "МетрикиPrometheus.Активность = ИСТИНА
						 |	И МетрикиPrometheus.МетодПолученияМетрики = &МетодПолученияМетрики
						 |	И МетрикиPrometheus.ИдентификаторРегламента = &ПустойИдентификатор";
	Иначе
		УсловиеЗапроса = "МетрикиPrometheus.Активность = ИСТИНА
						 |	И МетрикиPrometheus.МетодПолученияМетрики = &МетодПолученияМетрики
						 |  И МетрикиPrometheus.Код = &КодМетрики";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА = ИСТИНА", УсловиеЗапроса);
	Запрос.УстановитьПараметр("КодМетрики", Метрика);
	Запрос.УстановитьПараметр("МетодПолученияМетрики", МетодПолученияМетрики);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ПустойИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если МетодПолученияМетрики = Перечисления.МетодыПолученияМетрик.PullИзКэша Тогда
		Метрики = СформироватьМетрикиИзКэша(Выборка);
	Иначе
		Если Асинхронно Тогда
			Метрики = СформироватьМетрикиАсинхронно(Выборка, МетодПолученияМетрики);
		Иначе
			Метрики = СформироватьМетрикиСинхронно(Выборка, МетодПолученияМетрики);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Метрики;
	
КонецФункции

Функция СформироватьМетрикиИзКэша(Выборка)
	
	СтрокаМетрик = "";
	
	Пока Выборка.Следующий() Цикл
		
		ДатаНачалаРасчета = ТекущаяДатаСеанса();
		ДатаНачалаРасчетаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		ПараметрыМетрики = НовыеПараметрыМетрики();
		ПараметрыМетрики.Алгоритм = Выборка.Алгоритм;
		ПараметрыМетрики.КлючеваяОперация = Выборка.КлючеваяОперация;
		ПараметрыМетрики.ТипВычисленияМетрики = Выборка.ТипВычисленияМетрики;
		Массив = Выборка.ПериодыВычисления.Выгрузить().ВыгрузитьКолонку("ПериодВычисления");
		ПараметрыМетрики.ПериодыВычисления = Массив;
		
		Результат = ДанныеМетрики(ПараметрыМетрики);
		Если Результат.Ошибка Тогда
			Продолжить;
		КонецЕсли;
			
		Результат = ПривестиТаблицуРасчетаМетрикиКСтрокеPrometheus(
			Выборка.ИмяМетрики, Выборка.ТипМетрики, Выборка.Комментарий, Результат.МетрикаТаблицей);
		Если Результат.Ошибка Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаМетрик = СтрокаМетрик + Результат.МетрикаСтрокой; 
		
		ЗаписатьИнформациюОРасчетеМетрикиФоновымЗаданием(
			Выборка.Метрика, ДатаНачалаРасчетаВМиллисекундах, ДатаНачалаРасчета, Результат.МетрикаСтрокой);
		
	КонецЦикла;
	
	Возврат СтрокаМетрик;
	
КонецФункции

Функция СформироватьМетрикиАсинхронно(Выборка, МетодПолученияМетрики)
	
	МетрикиСтрокой = "";	
	МассивФоновыхЗаданий = Новый Массив;
	МассивПараметров = Новый Массив;
	
	// старт расчета
	Пока Выборка.Следующий() Цикл
		
		УникальныйИдентификатор = Новый УникальныйИдентификатор;
		АдресВХранилище = ПоместитьВоВременноеХранилище("", УникальныйИдентификатор);
		
		МассивПараметров.Очистить();
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ИмяМетрики", Выборка.ИмяМетрики);
		СтруктураПараметров.Вставить("ТипМетрики", Выборка.ТипМетрики);
		СтруктураПараметров.Вставить("Алгоритм", Выборка.Алгоритм);
		СтруктураПараметров.Вставить("Комментарий", Выборка.Комментарий);
		СтруктураПараметров.Вставить("АдресВХранилище", АдресВХранилище);
		СтруктураПараметров.Вставить("Метрика", Выборка.Метрика);
		СтруктураПараметров.Вставить("ТипВычисленияМетрики", Выборка.ТипВычисленияМетрики);
		СтруктураПараметров.Вставить("КлючеваяОперация", Выборка.КлючеваяОперация);
		СтруктураПараметров.Вставить("ПериодыВычисления",
			Выборка.ПериодыВычисления.Выгрузить().ВыгрузитьКолонку("ПериодВычисления"));
		МассивПараметров.Добавить(СтруктураПараметров);
		
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("МетрикиСервер.СформироватьМетрикуФоновымЗаданием", МассивПараметров, АдресВХранилище);
		МассивФоновыхЗаданий.Добавить(ФоновоеЗадание);
		
	КонецЦикла;
	
	Если Не МассивФоновыхЗаданий.Количество() Тогда
		Возврат МетрикиСтрокой;
	КонецЕсли;
	
	РасчетМетрикФоновымиЗаданиями(МассивФоновыхЗаданий, МетрикиСтрокой);
	
	Возврат МетрикиСтрокой;
	
КонецФункции

Процедура РасчетМетрикФоновымиЗаданиями(МассивФоновыхЗаданий, МетрикиСтрокой)
	
	УстановитьПривилегированныйРежим(Истина);
	МассивЗаданийКУдалению = Новый Массив;
	ДатаПринудительногоОстановаРасчета = ТекущаяДатаСеанса()
		+ ПараметрПодсистемы("1562.Prometheus_ПредельнаяДлительностьПолученияМетрикOnline");
	
	// Ожидание окончания расчета всех метрик
	Пока Истина Цикл
		
		ОбщегоНазначенияВызовСервера.Пауза(1);
		МассивЗаданийКУдалению.Очистить();
		Для Каждого ФоновоеЗадание Из МассивФоновыхЗаданий Цикл
			ИстеклоВремяОжидания = ТекущаяДатаСеанса() > ДатаПринудительногоОстановаРасчета;
			Если ИстеклоВремяОжидания Тогда
				КомментарийОшибки = "Не сформированы метрики. Не хватило времени на расчет метрик: " + МассивФоновыхЗаданий.Количество() + " шт.";
			Иначе
				Состояние = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ФоновоеЗадание.УникальныйИдентификатор).Состояние;
				Если Состояние = СостояниеФоновогоЗадания.Активно Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			МетрикиСтрокой = РезультатВыполненияЗадания(ФоновоеЗадание.Ключ, МетрикиСтрокой);
			МассивЗаданийКУдалению.Добавить(ФоновоеЗадание);
		КонецЦикла;
		
		// Удаление уже расчитаных метрик из массива контроля
		Для Каждого ЗаданиеКУдалению Из МассивЗаданийКУдалению Цикл
			МассивФоновыхЗаданий.Удалить(МассивФоновыхЗаданий.Найти(ЗаданиеКУдалению));
		КонецЦикла;
		
		Если ИстеклоВремяОжидания Тогда
			ЗаписьЖурналаРегистрации("Prometheus data exporter", УровеньЖурналаРегистрации.Ошибка, , , КомментарийОшибки);
		КонецЕсли;
		
		// Если нечего больше ждать - завершаем общее ожидание
		Если Не МассивФоновыхЗаданий.Количество() Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РезультатВыполненияЗадания(Ключ, МетрикиСтрокой)
	Попытка
		СтруктураВозврата = ПолучитьИзВременногоХранилища(Ключ);
		Если Не СтруктураВозврата.Ошибка Тогда
			МетрикиСтрокой = МетрикиСтрокой + СтруктураВозврата.МетрикаСтрокой;
		КонецЕсли;
	Исключение
		МетрикиСтрокой = МетрикиСтрокой + "";
	КонецПопытки;
	Возврат МетрикиСтрокой;
КонецФункции

Функция СформироватьМетрикиСинхронно(Выборка, МетодПолученияМетрики)
	
	СтрокаМетрик = "";
	УстановитьПривилегированныйРежим(Истина);
	ДатаНачалаРасчетов = ТекущаяДатаСеанса();
	ДатаПринудительногоОстановаРасчета = ДатаНачалаРасчетов
		+ ПараметрПодсистемы("1562.Prometheus_ПредельнаяДлительностьПолученияМетрикOnline");
	
	Пока Выборка.Следующий() Цикл
		
		ДатаНачалаРасчета = ТекущаяДатаСеанса();
		ДатаНачалаРасчетаВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		ИстеклоВремяОжидания = ДатаНачалаРасчета > ДатаПринудительногоОстановаРасчета;
		Если ИстеклоВремяОжидания Тогда
			КомментарийОшибки = "Не сформированы метрики. Не хватило времени на расчет. Прервались на: <" + Выборка.Метрика + ">";
			ЗаписьЖурналаРегистрации("Prometheus data exporter", УровеньЖурналаРегистрации.Ошибка, , , КомментарийОшибки);
			Прервать;
		КонецЕсли;
		
		ПараметрыМетрики = НовыеПараметрыМетрики();
		ПараметрыМетрики.Алгоритм = Выборка.Алгоритм;
		ПараметрыМетрики.КлючеваяОперация = Выборка.КлючеваяОперация;
		ПараметрыМетрики.ТипВычисленияМетрики = Выборка.ТипВычисленияМетрики;
		Массив = Выборка.ПериодыВычисления.Выгрузить().ВыгрузитьКолонку("ПериодВычисления");
		ПараметрыМетрики.ПериодыВычисления = Массив;
		
		Результат = ДанныеМетрики(ПараметрыМетрики);
		Если Результат.Ошибка Тогда
			Продолжить;
		КонецЕсли;
		
		Результат = ПривестиТаблицуРасчетаМетрикиКСтрокеPrometheus(
			Выборка.ИмяМетрики, Выборка.ТипМетрики, Выборка.Комментарий, Результат.МетрикаТаблицей);
		Если Результат.Ошибка Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаМетрик = СтрокаМетрик + Результат.МетрикаСтрокой; 
		
		ЗаписатьИнформациюОРасчетеМетрикиФоновымЗаданием(
			Выборка.Метрика, ДатаНачалаРасчетаВМиллисекундах, ДатаНачалаРасчета, Результат.МетрикаСтрокой);
		
	КонецЦикла;
	
	Возврат СтрокаМетрик;
	
КонецФункции

Функция СформироватьМетрику(Алгоритм)
	
	СтруктураВозврата = НоваяСтруктураДанныхМетрики();
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		Выполнить(Алгоритм);
		УстановитьПривилегированныйРежим(Ложь);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Prometheus data exporter",
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		СтруктураВозврата.Ошибка = Истина;
		СтруктураВозврата.ОписаниеОшибки = ОписаниеОшибки;
		Возврат СтруктураВозврата;
	КонецПопытки;
	
	СтруктураВозврата.МетрикаТаблицей = ТаблицаЗначений;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Процедура ЗаписатьИнформациюОРасчетеМетрикиФоновымЗаданием(Метрика, ДатаНачалаРасчетаВМиллисекундах, ДатаНачалаРасчета, МетрикаСтрокой)
	
	МассивПараметровРасчетаМетрик = Новый Массив;
	МассивПараметровРасчетаМетрик.Добавить(Метрика);
	МассивПараметровРасчетаМетрик.Добавить(ДатаНачалаРасчетаВМиллисекундах);
	МассивПараметровРасчетаМетрик.Добавить(ТекущаяУниверсальнаяДатаВМиллисекундах());
	МассивПараметровРасчетаМетрик.Добавить(ДатаНачалаРасчета);
	МассивПараметровРасчетаМетрик.Добавить(МетрикаСтрокой);
	ФоновыеЗадания.Выполнить("МетрикиСервер.ЗаписатьИнформациюОРасчетеМетрики", МассивПараметровРасчетаМетрик);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ОписаниеПараметровРегламентногоЗадания()
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Использование", Ложь);
	ПараметрыЗадания.Вставить("Предопределенное", Ложь);
	ПараметрыЗадания.Вставить("Расписание", Новый РасписаниеРегламентногоЗадания);
	ПараметрыЗадания.Вставить("Наименование", "");
	ПараметрыЗадания.Вставить("Ключ", "");
	ПараметрыЗадания.Вставить("Параметры", Неопределено);
	ПараметрыЗадания.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Возврат ПараметрыЗадания;
	
КонецФункции

Процедура УстановитьПараметрыПервоначальногоЗаполнения()
	УстановитьПривилегированныйРежим(Истина);
	Менеджер = РегистрыСведений.ПараметрыГлобальные;
	Менеджер.УстановитьЗначениеПараметра("1562.Prometheus_ПервоначальноеЗаполнениеВыполнено", Истина);
	Менеджер.УстановитьЗначениеПараметра("1562.Prometheus_ПредельнаяДлительностьПолученияМетрикOnline", 30);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Функция ПараметрПодсистемы(ИмяПараметра)
	УстановитьПривилегированныйРежим(Истина);
	Менеджер = РегистрыСведений.ПараметрыГлобальные;
	Значение = Менеджер.ЗначениеПараметра(ИмяПараметра, Ложь);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Значение;
КонецФункции

Процедура УдалитьРегламентноеЗаданиеПоИдентификатору(Идентификатор)
	РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
	Если Не РегламентноеЗадание = Неопределено И Не РегламентноеЗадание.Предопределенное Тогда
		РегламентноеЗадание.Удалить();
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьРегламентноеЗаданиеПоИдентификатору(Идентификатор = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
		Если РегламентноеЗадание = Неопределено Тогда
			РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.РасчетМетрикPrometheus);
		КонецЕсли;
	Иначе
		РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.РасчетМетрикPrometheus);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РегламентноеЗадание;
	
КонецФункции

Функция СредниеПараметрыКлючевойОперации(КлючеваяОперация, ПериодыВычисления)
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("duration", Новый ОписаниеТипов("Строка"));
	ТаблицаЗначений.Колонки.Добавить("name", Новый ОписаниеТипов("Строка"));
	ТаблицаЗначений.Колонки.Добавить("value", Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КлючеваяОперация", КлючеваяОперация);
	Для Каждого ПериодСправочник Из ПериодыВычисления Цикл
		
		РеквизитыПериода = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПериодСправочник, "Длительность,Обозначение");
		Запрос.Текст = ТекстЗапросаСреднееПоЗамерамКлючевойОперации();
		ДатаЗаписи = УниверсальноеВремя(ТекущаяДатаСеанса() - РеквизитыПериода.Длительность);
		Запрос.УстановитьПараметр("ДатаЗаписи", ДатаЗаписи);
		// BSLLS:CreateQueryInCycle-off
		// Запрос выполняется от силы несколько раз. Оптимизировать если только в ущерб читаемости
		Таблица = Запрос.Выполнить().Выгрузить();
		// BSLLS:CreateQueryInCycle-on
		Для Каждого Строка Из Таблица Цикл
			Для Каждого Колонка Из Таблица.Колонки Цикл
				НовыйЗамер = ТаблицаЗначений.Добавить();
				НовыйЗамер.duration = РеквизитыПериода.Обозначение;
				НовыйЗамер.name = Колонка.Имя;
				НовыйЗамер.value = Строка[Колонка.Имя];
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаЗначений;

КонецФункции

Функция ТекстЗапросаСреднееПоЗамерамКлючевойОперации()
	
	// ДатаЗаписи - индексируемое
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СРЕДНЕЕ(ЗамерыВремени.ВремяВыполнения) КАК СреднееВремяВыполнения,
	|	СРЕДНЕЕ(ЗамерыВремени.ВремяВыполнения / ЗамерыВремени.ВесЗамера) КАК СреднееВремяВыполненияСУчетомВеса,
	|	СРЕДНЕЕ(ЗамерыВремени.ВесЗамера) КАК СреднийВесЗамера,
	|	СУММА(1) КАК КоличествоЗамеров
	|ИЗ
	|	РегистрСведений.ЗамерыВремени КАК ЗамерыВремени
	|ГДЕ
	|	ЗамерыВремени.КлючеваяОперация = &КлючеваяОперация
	|	И ЗамерыВремени.ДатаЗаписи > &ДатаЗаписи";
	Возврат ТекстЗапроса;
	
КонецФункции


#КонецОбласти
